In [11]:
import pandas as pd
import numpy as np

JOIN INDEX MATCH

In [12]:
izq_join = pd.DataFrame({'A':['A0','A1','A2','A3'],
 'B':['B0','B1','B2','B3']},
 index=['k0','k1','k2','k3'])
izq_join

     A   B
k0  A0  B0
k1  A1  B1
k2  A2  B2
k3  A3  B3

In [16]:
der_join = pd.DataFrame({'C':['C0','C1','C2','C3'],
'D':['D0','D1','D2','D3']},
 index=['k0','k3','k4','k5'])
der_join

     C   D
k0  C0  D0
k3  C1  D1
k4  C2  D2
k5  C3  D3

In [17]:
#Hace el join por indice
izq_join.join(der_join)

     A   B    C    D
k0  A0  B0   C0   D0
k1  A1  B1  NaN  NaN
k2  A2  B2  NaN  NaN
k3  A3  B3   C1   D1

In [18]:
#Los unicos indices que se comparten es k0 y k3 en izq_join y der_join
izq_join.join(der_join,how='inner')

     A   B   C   D
k0  A0  B0  C0  D0
k3  A3  B3  C1  D1

In [19]:
#Te trae todos los de la izquierda (columnas A y B) y agrega los k0 y k3 de la derecha, que son los que comparte con
#la izquierda, y entonces llena solo k0 y k3 en columnas C y D, al resto los pone como NaN
izq_join.join(der_join,how='left')

     A   B    C    D
k0  A0  B0   C0   D0
k1  A1  B1  NaN  NaN
k2  A2  B2  NaN  NaN
k3  A3  B3   C1   D1

In [20]:
#Te trae todos los de la derecha (columnas C y D) y agrega los k0 y k3 de la izquierda, que son los que comparte con
#la derecha, y entonces llena solo k0 y k3 en columnas A y B, al resto los pone como NaN
izq_join.join(der_join,how='right')

      A    B   C   D
k0   A0   B0  C0  D0
k3   A3   B3  C1  D1
k4  NaN  NaN  C2  D2
k5  NaN  NaN  C3  D3

In [21]:
#Te trae todos los de la derecha y la izquierda, donde no hay valores en la columna, coloca NaN
izq_join.join(der_join,how='outer')

      A    B    C    D
k0   A0   B0   C0   D0
k1   A1   B1  NaN  NaN
k2   A2   B2  NaN  NaN
k3   A3   B3   C1   D1
k4  NaN  NaN   C2   D2
k5  NaN  NaN   C3   D3